Catalogs/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМаркировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Криптохвост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйКодМаркировки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПоступления</Name>
					<Comment>0 - наша эмиссия, 1 - при приемке приходного ордера, 2 - из ЭДО при создании инвойса</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУпаковки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипУпаковкиМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяЕдиницаПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВложенныеКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихкодНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ШтрихкодыНоменклатуры/Ext/ManagerModule.bsl
// ДанныеКМ - Структура или строка ТЗ
Функция СоздатьКодМаркировки(ДанныеКМ) Экспорт
	
	//+Шульман А. 18.04.2025 #UT10-5201 
	СпрОбъект = Справочники.ШтрихкодыНоменклатуры.СоздатьЭлемент();
	
	ЗаполнитьЗначенияСвойств(СпрОбъект, ДанныеКМ);
	
	//+Сёмин Р.И. 23.09.2026 #UT10-6057
	ТоварнаяГруппаЧЗ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпрОбъект.Номенклатура, "ТоварнаяГруппаЧестногоЗнака");
	
	Если ТоварнаяГруппаЧЗ.ПеременныеХарактеристики <> Истина Тогда
		СпрОбъект.МинимальнаяЕдиницаПотребления = 0;
	КонецЕсли;
	//-Сёмин Р.И. 23.09.2026 #UT10-6057
	
	СпрОбъект.Записать();
	
	Возврат СпрОбъект.Ссылка
	//-Шульман А. 18.04.2025 #UT10-5201

КонецФункции // ()

Процедура ПечатьЭтикеткиМаркировки(МассивШтрихкодов , Принтер , СразуНаПринтер = Ложь) Экспорт
	//+Кабанов А.В. 31.07.2025 # UT10-5345 
	Если НЕ МассивШтрихкодов.Количество() = 0 Тогда
		
		ТабличныйДокумент   = Новый ТабличныйДокумент;
		Макет               = ПолучитьМакет("ШаблонЭтикетки_20х20");
		ОбластьМакета    	= Макет.ПолучитьОбласть("ЭтикеткаШирина|ЭтикеткаВысота");
		
		
		Для Каждого ШтрихкодДляПечати Из МассивШтрихкодов Цикл
			
			//+Кабанов А.В. 27.08.2025 # UT10-5395
			КодGS1ДляКомпонентыПечати = МенеджерОборудованияМаркировка.КодGS1ДляКомпонентыПечати(ШтрихкодДляПечати); 
			//-Кабанов А.В. 27.08.2025 # UT10-5395
			
			Если СтрДлина(ШтрихкодДляПечати) > 35 Тогда
				ДелительКартинки = 0.45;
			Иначе
				ДелительКартинки = 0.7;
			КонецЕсли;				
				
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина"          , Окр(ОбластьМакета.Рисунки.КартинкаШтрихкода.Ширина / ДелительКартинки));
			ПараметрыШтрихкода.Вставить("Высота"          , Окр(ОбластьМакета.Рисунки.КартинкаШтрихкода.Высота/ ДелительКартинки));
			ПараметрыШтрихкода.Вставить("Штрихкод"        , КодGS1ДляКомпонентыПечати); 
			ПараметрыШтрихкода.Вставить("ТипКода"         , 24); // GS1 DataMatrix
			ПараметрыШтрихкода.Вставить("ОтображатьТекст" , Ложь);
			ПараметрыШтрихкода.Вставить("РазмерШрифта"    , 6);
			
			ОбластьМакета.Рисунки.КартинкаШтрихкода.Картинка = ОбщегоНазначения.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
			ОбластьМакета.Рисунки.КартинкаШтрихкода.Верх = 1;
			ОбластьМакета.Рисунки.КартинкаШтрихкода.Лево = 0.5;
			ОбластьМакета.Рисунки.КартинкаШтрихкода.ГраницаСверху = Ложь;
			ОбластьМакета.Рисунки.КартинкаШтрихкода.ГраницаСлева  = Ложь;
			ОбластьМакета.Рисунки.КартинкаШтрихкода.ГраницаСнизу  = Ложь;
			ОбластьМакета.Рисунки.КартинкаШтрихкода.ГраницаСправа = Ложь;
			
			ОбластьМакета.ПолеСверху     = 0;
			ОбластьМакета.ПолеСлева      = 0;
			ОбластьМакета.ПолеСнизу      = 0;
			ОбластьМакета.ПолеСправа     = 0;		
			ОбластьМакета.ВысотаСтраницы = 22;
			ОбластьМакета.ШиринаСтраницы = 22;
			
			ТабличныйДокумент.Вывести(ОбластьМакета);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
		КонецЦикла;
		
		ТабличныйДокумент.ПолеСверху     = 0;
		ТабличныйДокумент.ПолеСлева      = 0;
		ТабличныйДокумент.ПолеСнизу      = 0;
		ТабличныйДокумент.ПолеСправа     = 0;		
		//ТабличныйДокумент.ВысотаСтраницы = 22;
		//ТабличныйДокумент.ШиринаСтраницы = 22;		
		
		ТабличныйДокумент.АвтоМасштаб = Истина;
		ТабличныйДокумент.ИмяПринтера = Принтер;
		
		Если СразуНаПринтер Тогда
			ТабличныйДокумент.Напечатать();
		Иначе
			ТабличныйДокумент.Показать();
		КонецЕсли;		
		
	КонецЕсли;
	//-Кабанов А.В. 31.07.2025 # UT10-5345 
КонецПроцедуры

Функция ПолучитьКодыМаркировкиПоДокументу(Документ) Экспорт

	//+Белов А. 17.02.2026 #UT10-5696
	//+Доработка: поддержка КорректировкаРеализации
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КодыМаркировкиВДокументах.Ссылка КАК Документ,
		|	КодыМаркировкиВДокументах.КодМаркировки.Номенклатура КАК Номенклатура, 
		|	КодыМаркировкиВДокументах.КодМаркировки.Номенклатура.КодМДМ КАК НоменклатураКодМДМ,
		|	КодыМаркировкиВДокументах.КодМаркировки КАК ШтрихкодНоменклатуры,
		|	КодыМаркировкиВДокументах.КодМаркировки.КодМаркировки КАК КодМаркировки,
		|	Ложь КАК Неактивен,
		|	1 КАК Количество
		|ИЗ
		|	Документ.РеализацияТоваровУслуг.КодыМаркировки КАК КодыМаркировкиВДокументах
		|ГДЕ
		|	КодыМаркировкиВДокументах.Ссылка = &Документ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КодыМаркировкиКорректировки.Ссылка,
		|	КодыМаркировкиКорректировки.КодМаркировки.Номенклатура,
		|	КодыМаркировкиКорректировки.КодМаркировки.Номенклатура.КодМДМ,
		|	КодыМаркировкиКорректировки.КодМаркировки,
		|	КодыМаркировкиКорректировки.КодМаркировки.КодМаркировки,
		|	Ложь,
		|	1
		|ИЗ
		|	Документ.КорректировкаРеализации.КодыМаркировки КАК КодыМаркировкиКорректировки
		|ГДЕ
		|	КодыМаркировкиКорректировки.Ссылка = &Документ";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	//-Доработка: поддержка КорректировкаРеализации
	//-Белов А. 17.02.2026 #UT10-5696	     

КонецФункции // ()

Функция НайтиШтрихкод(КодМаркировки, Номенклатура = Неопределено) Экспорт
	
	//+Макрушин Е. 26.02.2026 #UT10-5657
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихКодыНоменклатуры.Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыНоменклатуры КАК ШтрихКодыНоменклатуры
		|ГДЕ
		|	НЕ ШтрихКодыНоменклатуры.ПометкаУдаления
		|	И ШтрихКодыНоменклатуры.КодМаркировки = &КодМаркировки
		|	И (&БезОтбораПоНоменклатуре
		|			ИЛИ ШтрихКодыНоменклатуры.Номенклатура = &Номенклатура)";
	
	Запрос.УстановитьПараметр("КодМаркировки", КодМаркировки);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("БезОтбораПоНоменклатуре", НЕ ЗначениеЗаполнено(Номенклатура));
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
    Возврат Выборка.Ссылка;
    //-Макрушин Е. 26.02.2026 #UT10-5657
	
КонецФункции
